def tennti(table, num):
    return_lst = []
    print("転置表の値, 格納する値")
    for i in table:
        return_lst.append(num[i-1])
        print(str(i) + ", "+ str(num[i-1]))
    return "".join(return_lst)

if __name__ == '__main__':
    key = "1001111101010101010100000110100010110010100011101110101000111001"
    
    pc1 = tennti([57, 49, 41, 33, 25, 17, 9,
                  1, 58, 50, 42, 34, 26, 18,
                  10, 2, 59, 51, 43, 35, 27,
                  19, 11, 3, 60, 52, 44, 36,
                  63, 55, 47, 39, 31, 23, 15,
                  7, 62, 54, 46, 38, 30, 22,
                  14, 6, 61, 53, 45, 37, 29,
                  21, 13, 5, 28, 20,12, 4
                  ], key)
    print("結果:" + pc1 + ", 長さ" + str(len(pc1)))